In [2]:
import pandas as pd

In [3]:
players_df = pd.read_csv('~/dotaMediaTermPaper/data/players_df.csv', index_col=0)
players_df = players_df.rename(columns={'search_count':'search_count_player', 'total_earn':'total_earn_player'})

In [5]:
players_df.head()

,name,search_count_player,ID,Team,status,total_earn_player
0,Egor Zhabotinskii,52600,.Ark,NaN,Active\n,6529.0
1,Jon Andersen,45100000,13abyKnight,NaN,Active\n,101159.0
2,Sivatheeban Sivanathapillai,1020,1437,TNC Tiger,Active\n,193527.0
3,Zeng Chen,914000,290,PiPiXia,Active\n,2869.0
4,James Harding,6830000,2GD,NaN,Inactive\n,NaN

In [6]:
teams_df = pd.read_csv('~/dotaMediaTermPaper/data/teams_df.csv', index_col=0)

In [9]:
teams_df.head()

,name,search_count,Unnamed: 0.1,created_year,location,manager,manager_from,points,rank,region,total_earnings
0,compLexity Gaming,2390000,0,Organization: 2003Dota 2: 2012-02-16,USA,Joshua Schmidt,USA,135.0,19.0,North America,825959.0
1,Evil Geniuses,675000,1,Organization: 1999Dota 2: 2011-10-24,USA,Phillip Aram,USA,1335.0,11.0,North America,15144669.0
2,Immortals,3260000,2,Organization: 2015-10-07Dota 2: 2017-09-13,USA,Josh Arkin,USA,90.0,21.0,North America,47500.0
3,OpTic Gaming,2390000,3,Organization: 2006Dota 2: 2017-09-26,USA,Kodiak Shroyer,USA,1800.0,9.0,North America,495800.0
4,VGJ.Storm,2780000,4,NaN,USA,KBBQ,USA,NaN,NaN,North America,342000.0

In [10]:
teams_df[['search_count', 'total_earnings']].corr()

                search_count  total_earnings
search_count        1.000000        0.175951
total_earnings      0.175951        1.000000